controllers/UserController.php

INSERT INTO `user` (`name`, `email`) VALUES ('testRegister', 'test@test.com')
---
        $params = [
            ':name' => $username,
        ];
        $usernameExist = $db->createCommand($sql, $params)->queryScalar();